disp('Виберіть яку частину плануєте виконати');
disp('1.середнє арифметичне двох чисел');
disp('2.різницю 1-го і 2-го');
disp('3.добуток 2-го і квадрату 1-го числа..');
zminna = input('введіть номер: ');
switch zminna
    case 1
disp('Задайте два числа');
a =input('a=');
b =input('b=');
c = (b+a) / 2;
fprintf( 'середнє арифметичне двох чисел: %d \n',c);
    case 2
disp('Задайте два числа');
a =input('a=');
b =input('b=');
r = a - b ;
fprintf( 'різницю 1-го і 2-го: %d \n',r); 
    case 3
disp('Задайте два числа');
a =input('a=');
b =input('b=');
dobutok =b * a^2;
fprintf( 'добуток 2-го і квадрату 1-го числа.: %d \n',dobutok); 
end
